accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/billing/GetBillInformationResponse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetBillInformation">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetBillInformationResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Zero or more repetitions:-->
               <get:DocumentsList>
                  <!--Optional:-->
                  <get:ComplaintStatus>?</get:ComplaintStatus>
                  <!--Optional:-->
                  <get:ComplaintDate>?</get:ComplaintDate>
                  <!--Optional:-->
                  <get:DueDate>?</get:DueDate>
                  <!--Optional:-->
                  <get:EntryDate>?</get:EntryDate>
                  <!--Optional:-->
                  <get:InvoiceAmount>?</get:InvoiceAmount>
                  <!--Optional:-->
                  <get:CurrentOpenAmount>?</get:CurrentOpenAmount>
                  <!--Optional:-->
                  <get:ReferenceDate>?</get:ReferenceDate>
                  <!--Optional:-->
                  <get:DocumentReferenceNumber>?</get:DocumentReferenceNumber>
                  <!--Optional:-->
                  <get:DocumentStatus>?</get:DocumentStatus>
                  <!--Optional:-->
                  <get:TransactionID>?</get:TransactionID>
                  <!--Optional:-->
                  <get:PaymentFlag>?</get:PaymentFlag>
                  <!--Optional:-->
                  <get:BillingAccountCode>?</get:BillingAccountCode>
                  <!--Optional:-->
                  <get:BillingAccountName>?</get:BillingAccountName>
                  <!--Optional:-->
                  <get:BillingAccountID>?</get:BillingAccountID>
                  <!--Optional:-->
                  <get:InvoiceType>?</get:InvoiceType>
                  <!--Optional:-->
                  <get:ContractID>?</get:ContractID>
                  <!--Optional:-->
                  <get:ContractIDPub>?</get:ContractIDPub>
                  <!--Optional:-->
                  <get:CustomerID>?</get:CustomerID>
                  <!--Optional:-->
                  <get:CustomerIDPub>?</get:CustomerIDPub>
                  <!--Optional:-->
                  <get:CurrencyID>?</get:CurrencyID>
                  <!--Optional:-->
                  <get:CurrencyIDPub>?</get:CurrencyIDPub>
                  <!--Optional:-->
                  <get:BtCseq>?</get:BtCseq>
                  <!--Optional:-->
                  <get:BtOhdisamtDoc>?</get:BtOhdisamtDoc>
                  <!--Optional:-->
                  <get:BtOhfulfildate>?</get:BtOhfulfildate>
                  <!--Optional:-->
                  <get:BtOhinvtype>?</get:BtOhinvtype>
                  <!--Optional:-->
                  <get:BtOhmod>?</get:BtOhmod>
                  <!--Optional:-->
                  <get:BtOhshpdate>?</get:BtOhshpdate>
                  <!--Optional:-->
                  <get:Details>
                     <!--Zero or more repetitions:-->
                     <get:DetailsList>
                        <!--Optional:-->
                        <get:AmountDoc>?</get:AmountDoc>
                        <!--Optional:-->
                        <get:Global>?</get:Global>
                        <!--Optional:-->
                        <get:Name>?</get:Name>
                        <!--Optional:-->
                        <get:ProfileID>?</get:ProfileID>
                        <!--Optional:-->
                        <get:SeqNo>?</get:SeqNo>
                        <!--Optional:-->
                        <get:SnCode>?</get:SnCode>
                        <!--Optional:-->
                        <get:SncodePub>?</get:SncodePub>
                     </get:DetailsList>
                  </get:Details>
                  <!--Optional:-->
                  <get:GLCurrencyID>?</get:GLCurrencyID>
                  <!--Optional:-->
                  <get:GLCurrencyIDPub>?</get:GLCurrencyIDPub>
                  <!--Optional:-->
                  <get:PrimaryDocumentCurrencyID>?</get:PrimaryDocumentCurrencyID>
                  <!--Optional:-->
                  <get:PrimaryDocumentCurrencyIDPub>?</get:PrimaryDocumentCurrencyIDPub>
               </get:DocumentsList>
               <!--Optional:-->
               <get:CustomerBalance>
                  <!--Optional:-->
                  <get:DueDate>?</get:DueDate>
                  <!--Optional:-->
                  <get:LastBilledDate>?</get:LastBilledDate>
                  <!--Optional:-->
                  <get:OutstandingAmount>?</get:OutstandingAmount>
                  <!--Optional:-->
                  <get:PreviousBalance>?</get:PreviousBalance>
                  <!--Optional:-->
                  <get:TotalInvoiceAmount>?</get:TotalInvoiceAmount>
                  <!--Optional:-->
                  <get:TotalPaidAmount>?</get:TotalPaidAmount>
                  <!--Optional:-->
                  <get:UnbilledAmount>?</get:UnbilledAmount>
                  <!--Optional:-->
                  <get:TotalOpenAmount>?</get:TotalOpenAmount>
                  <!--Optional:-->
                  <get:TotalOccAmount>?</get:TotalOccAmount>
                  <!--Optional:-->
                  <get:TotalUnpaidDeposit>?</get:TotalUnpaidDeposit>
               </get:CustomerBalance>
            </lcew:Body>
         </Response>
      </web:GetBillInformationResponse>
   </soapenv:Body>
</soapenv:Envelope>